package com.company;

// Клас Main, що містить головний метод програми
public class Main {
    public static void main(String[] args) {
        // Встановлюємо кількість елементів масиву
        int number_of_cells = 100000000;
        // Встановлюємо кількість потоків
        int threadNum = 3;                                                      // Кількість потоків
        // Засікаємо час початку виконання програми
        long time = System.nanoTime();                                          // Засікаємо час
        // Створюємо екземпляр класу ArayClass з вказаною кількістю елементів та потоків
        ArrayClass arrClass = new ArrayClass(number_of_cells, threadNum);         // Клас з усіма обраховуваннями
        // Знаходимо мінімальний елемент у масиві за допомогою одного потоку
        long minIndex = arrClass.OneThreadMin(0, number_of_cells);      // Шукаємо мінімальний елемент у масиві за допомогою одного потоку
        // Обчислюємо час роботи програми
        time = System.nanoTime() - time;                                        // Обчислюємо час роботи програми
        // Виводимо на екран мінімальний елемент і час роботи програми з одним потоком
        System.out.println(minIndex + " time:" + time);                         // Виводимо на екран мінімальний елемент і час роботи програми з одним потоком
        // Засікаємо час початку виконання програми
        time = System.nanoTime();                                               // Засікаємо час
        // Знаходимо minIndex в n-кількостях потоків
        minIndex = arrClass.threadMin();                                        // Знаходимо minIndex в n-кількостях потоків
        // Обчислюємо час роботи програми
        time = System.nanoTime() - time;                                        // Обчислюємо час роботи програми
        // Виводимо на екран мінімальний елемент і час роботи програми в n-потоках
        System.out.println(minIndex + " time:" + time);                         // Виводимо на екран мінімальний елемент і час роботи програми в n-потоках
    }
}
